[
  {
    "id": 1,
    "author": "Lisa Eadicicco",
    "headline": "Most Exciting New Phones for 2023: iPhone 15, Galaxy S23 and More",
    "body": "It's hard to know what's in store for the smartphone industry in 2023. But with companies like Apple, Google and Samsung mostly sticking to the same launch routine every year, it's possible to make some educated guesses. The iPhone 15 lineup, for example, is expected to arrive in September -- possibly with USB-C charging for the first time. If Samsung maintains its typical release cycle, the Galaxy S23 will be one of the first new phones we see in 2023. Such launches would come after the smartphone space took subtle but important steps forward in 2022. The iPhone, for example, gained satellite connectivity for emergencies and car crash detection, while Google found more ways to make use of its custom Tensor chip in the Pixel 7 and 7 Pro. Samsung, meanwhile, gave its flagship Galaxy S lineup a fresh look and an upgraded camera. Here are the new phones we're likely to see in 2023 based on previous launch cycles, rumors and reports.",
    "image": "https://www.cnet.com/a/img/resize/fe31d63d7403b7afa70cd0d4c28353c37075cfba/hub/2022/04/27/9ea7e4ab-02c3-438e-97c9-f72c632bcaf7/stack-of-phones-2022-rebranding-orange-03.jpg?auto=webp&fit=crop&height=720&width=1280"
  },
  {
    "id": 2,
    "author": "Nelson Aguilar",
    "headline": "Blur Your Home on Google Maps Right Now to Protect Your Privacy",
    "body": "Google is a part of all our lives. All you need to do is take a look at Google Maps. It's how we get directions, explore city landmarks in 3D, read and leave restaurant reviews, find public transport arrival times and so much more. But there's one feature within Google Maps that can quickly become a real privacy issue. If you've ever used Street View, you know that you can enter any address into Google Maps and look at a recent image of what's there, whether it's a business or a residence. And while it's useful for knowing what a building looks like when you're getting directions there, it makes it easier for stalkers or criminals to plan their way inside of your home. They've got a free ticket to examine your home online, look for any cameras and find a possible window to pry in through. Anyone can do this in person, but Google Maps makes it easier because you can spy on someone's home from the comfort of your phone or computer. Fortunately, there is an easy way to blur your home on Google Maps and help prevent others from seeing too many details of where you live. Here's how to do it. For more, here are seven essential Google Maps tips for the holidays and how Google Maps can help you figure out dinner. How to blur your home on Google Maps You'll need to do this on your computer, as the blurring feature isn't available in the Google Maps application on iOS or Android, and while it is accessible through the web browser on your mobile device, it's rather difficult to use, so use a trusted web browser on your Mac or PC instead. At maps.google.com, enter your home address in the search bar at the top-right, hit return, then click the photo of your home that appears. Address in Google Maps Click on the photo of your home, right above your address, on the top-left part of the page",
    "image": "https://www.cnet.com/a/img/resize/fe35142303c09096b86a901a118a188cad42b2b2/hub/2022/12/07/808c34d8-641a-4d1f-87bd-29219d4c59e5/screen-shot-2022-12-07-at-2-34-25-pm.png?auto=webp&fit=crop&height=675&width=1200"
  },
  {
    "id": 3,
    "author": "Eli Blumenthal",
    "headline": "AT&T Offers Up to $1,000 Off New iPhone, Galaxy Upgrades Ahead of the Holidays",
    "body": "If you're on AT&T and have been debating getting a new iPhone or Samsung Galaxy phone this holiday season, you may find yourself with a better deal now even though we're well past Black Friday. The carrier has upped its promotion for new and upgrading users from $800 off a new Apple or Samsung device to up to $1,000 off, so long as you're trading in a phone. You'll also need to have an unlimited plan to be eligible for the discount, which will be dished out as bill credits over the course of a 36-month installment plan. AT&T has dabbled with offering up to $1,000 off iPhones before. Most recently, it dangled the discount around the launch of Apple's new iPhone 14 line before scaling it back down in recent weeks to up to $800 off. For the Galaxy S22 launch in February, AT&T offered up to $800 off the new models so long as you were trading in any older Galaxy S, Galaxy Note or Galaxy Z phone, including those that were broken. To get $1,000 off a new iPhone, the device you are trading into AT&T would need to be valued by the carrier at a minimum of $230. This includes the iPhone 11 Pro Max, iPhone 12 line (except the 12 Mini) or iPhone 13 line; Samsung Galaxy S21 Ultra 5G, S22 line, Z Fold 2 or Fold 3; Google's Pixel 6 Pro and OnePlus' 10 Pro. ",
    "image": "https://www.cnet.com/a/img/resize/14758a67f5463c032c24e6c98f70583101634196/hub/2021/03/31/8478ff56-b882-46ca-96c3-b3f2333f85f7/015-att-network-mobile-carrier-logo-2021.jpg?auto=webp&fit=crop&height=675&width=1200"
  }
]
